# GetPaletteVisibility

## Description
Gets the visibility state of a palette.

```pascal
FUNCTION GetPaletteVisibility(paletteName : STRING): BOOLEAN;
```

```python
def vs.GetPaletteVisibility(paletteName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paletteName|STRING|Name of the palette|

## Remarks
oops, version obsolete is not correct.

oops, implemented version is not correct either.

## See Also
VS Functions:
SetPaletteVisibility

## Version
Availability: from VectorWorks10.0

## Category
* Utility